Catalogs/ГруппыФинансовогоУчетаДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГруппыФинансовогоУчетаДоходовРасходов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДеятельностиНФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДеятельностиНФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГруппы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГруппФинансовогоУчетаДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвязаннаяАналитикаУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАналитики</Name>
							<Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыФинансовогоУчетаДоходовРасходов/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ОтборПоОбъектуАналитики = (Параметры.Свойство("ОбъектАналитики") И ЗначениеЗаполнено(Параметры.ОбъектАналитики));
	
	// проведем эвристический анализ: если переданному объекту аналитики не соответствует ни одна ГФУ,
	// оотбразим полный список ГФУ
	Если ОтборПоОбъектуАналитики Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	СвязаннаяАналитикаУчета.Ссылка
			|ИЗ
			|	Справочник.ГруппыФинансовогоУчетаДоходовРасходов.СвязаннаяАналитикаУчета КАК СвязаннаяАналитикаУчета
			|ГДЕ
			|	СвязаннаяАналитикаУчета.ОбъектАналитики = &ОбъектАналитики";
			
		Запрос.УстановитьПараметр("ОбъектАналитики", Параметры.ОбъектАналитики);
		
		Если Запрос.Выполнить().Пустой() Тогда
			ОтборПоОбъектуАналитики = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// установим параметры списка
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ОтборПоОбъектуАналитики", ЭтаФорма.ОтборПоОбъектуАналитики);
	
	Если ЭтаФорма.ОтборПоОбъектуАналитики Тогда
		ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ОбъектАналитики", Параметры.ОбъектАналитики);
	Иначе
		ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ОбъектАналитики", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.ОтборПоОбъектуАналитики Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Иначе
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Группа Тогда
		Возврат;
	КонецЕсли;
	
	Текст = НСтр("ru = 'Есть возможность подобрать группу доходов/расходов из классификатора.
		|Подобрать?'");
		
	ДополнительныеПараметры = Новый Структура;
	Если Копирование Тогда
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Код", Элемент.ТекущиеДанные.Код);
		ЗначенияЗаполнения.Вставить("Наименование", Элемент.ТекущиеДанные.Наименование);
		ЗначенияЗаполнения.Вставить("Описание", Элемент.ТекущиеДанные.Описание);
		ДополнительныеПараметры.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ВопросПодобратьГруппуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьИзМакета(Команда)
	
	ДанныеВыбораВидовДеятельностиНФО = ПолучитьДанныеВыбораВидовДеятельностиНФО();
	ДанныеВыбораВидовДеятельностиНФО.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект,),
	"Выберите вид деятельности НФО");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросПодобратьГруппуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДанныеВыбораВидовДеятельностиНФО = ПолучитьДанныеВыбораВидовДеятельностиНФО();
		ДанныеВыбораВидовДеятельностиНФО.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект,),
			"Выберите вид деятельности НФО");
	Иначе
		ОткрытьФорму("Справочник.ГруппыФинансовогоУчетаДоходовРасходов.Форма.ФормаЭлемента", ДополнительныеПараметры, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораВидовДеятельностиНФО()

	МассивОтбора = Новый Массив;
	
	МакетыМетаданные = Метаданные.Справочники.ГруппыФинансовогоУчетаДоходовРасходов.Макеты;
	Для каждого МакетМетаданные Из МакетыМетаданные Цикл
		
		ИмяМакета = МакетМетаданные.Имя;
		
		Попытка
			
			ПеречислениеСсылка = Перечисления.ВидыДеятельностиНФО[ИмяМакета];
			МассивОтбора.Добавить(ПеречислениеСсылка);
		
		Исключение
		
		КонецПопытки;
	
	КонецЦикла;
	
	СтруктураОтбора = Новый Структура("Ссылка",МассивОтбора);
	
	Возврат Перечисления.ВидыДеятельностиНФО.ПолучитьДанныеВыбора(Новый Структура("Отбор,СтрокаПоиска", СтруктураОтбора, Неопределено));

КонецФункции // ВернутьСписокЗначенийВидовДеятельностиНФО()

&НаКлиенте
Процедура ПодобратьИзМакетаПоВидуДеятельностиНФО(ВидДеятельностиНФО)
			
	СтрокаПоиска = "";
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СтрокаПоиска = ТекДанные.Код;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("СтрокаПоиска,ИмяСправочника,ВидДеятельностиНФО", СтрокаПоиска,"ГруппыФинансовогоУчетаДоходовРасходов",ВидДеятельностиНФО);
	ОткрытьФорму("Справочник.ГруппыФинансовогоУчетаДоходовРасходов.Форма.ФормаПодбораИзМакетаВидовДоходовРасходов",
		СтруктураПараметров, ЭтаФорма);		
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ПодобратьИзМакетаПоВидуДеятельностиНФО(ВыбранныйЭлемент.Значение.Значение);

КонецПроцедуры


#КонецОбласти
